package Task2;

/*
Создайте класс Customer (покупатель).
Покупатель должен обладать характеристиками: имя, возраст, количество покупок.
Создайте лист и наполните его десятью покупателями с разными именами,
в возрасте от 20 до 80 лет, количество покупок - от 1 до 5.
Представьте, что есть магазин, который проводит акцию.
Задача - определить победителей акции и вывести их в консоль.
Условия акции: побеждают два человека пенсионного возраста (от 65 лет включительно),
которые совершили минимум 3 покупки в магазине.
Важное уточнение: одинаковые покупатели два раза к участию в акции не допускаются.
Задание должно быть решено при помощи одного стрима.
 */

import java.util.List;

public class Main {
    public static void main(String[] args) {

        List<Customer> customers = List.of(
                new Customer("Вася", 20, 2),
                new Customer("Маша", 25, 3),
                new Customer("Михаил", 65, 5),
                new Customer("Клавдия", 70, 4),
                new Customer("Петя", 50, 1),
                new Customer("Катя", 20, 6),
                new Customer("Фёдор", 30, 10),
                new Customer("Таня", 35, 15),
                new Customer("Сергей", 80, 7),
                new Customer("Юлия", 21, 21)
        );

        customers.stream()
                .filter(x -> x.getAge() >= 65)
                .filter(x -> x.getPurchase() >= 3)
                .distinct()
                .limit(2)
                .forEach(System.out::println);
    }
}